In [ ]:
#importando a  biblioteca Pandas
import pandas as pd

In [ ]:
#Leitura dos arquivos
df1 = pd.read_excel ("Aracaju.xlsx")
df2 = pd.read_excel ("Fortaleza.xlsx")
df3 = pd.read_excel ("Natal.xlsx")
df4 = pd.read_excel ("Recife.xlsx")
df5 = pd.read_excel ("Salvador.xlsx")

In [ ]:
#juntando todos os arquivos
df  =  pd.concat([df1, df2, df3, df4, df5])

In [ ]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#Exibindo as 5 ultimas linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#Exibindo as estruturas
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#Exibindo as estruturas
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [ ]:
#Exibindo as estruturas
df3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [ ]:
#Exibindo as estruturas
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [ ]:
#Exibindo as estruturas
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [ ]:
#juntando todos os arquivos
df  =  pd.concat([df1, df2, df3, df4, df5])

In [ ]:
#Exibindo as estruturas
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
84   Salvador 2019-01-01   22.99    1036     1
172  Salvador 2019-01-02    6.70    1035     1
166  Salvador 2019-01-02  111.72    1035     3
112     Natal 2019-01-02   43.00    1036     3

In [ ]:
#Exibindo as estruturas
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
#Alterando o tipo de dado da coluna lojaID
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [ ]:
# Tratando  valores faltantes

In [ ]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituindo os valores nulos pela mÃ©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [ ]:
df["Vendas"].mean()

122.61180089485438

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
189   Salvador 2019-01-02  139.73   1037     2
20      Recife 2019-01-01   42.35    982     3
103     Recife 2019-01-01   41.65    982     3
118      Natal 2019-01-02   92.21   1035     2
11   Fortaleza 2019-01-01   42.19   1003     3
202   Salvador 2019-01-02   22.45   1036     1
39      Recife 2019-01-01  143.58    981     3
118     Recife 2019-03-02   17.70    981     5
66   Fortaleza 2019-01-01   35.11   1005     6
111     Recife 2019-03-02    8.00    981     3
49      Recife 2019-01-01  122.55    981     1
79     Aracaju 2018-01-01    5.59   1521     4
52      Recife 2019-01-01   11.87    981     6
14       Natal 2018-06-03  660.00    853     3
64      Recife 2019-01-01   89.32    983     2

In [ ]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

In [ ]:
#Criando colunas novas

In [ ]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [ ]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [ ]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [ ]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [ ]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [ ]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [ ]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

# Trabalhando com datas

In [ ]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [ ]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [ ]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [ ]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [ ]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
101    Recife 2019-01-01  172.55  ...  1207.85             7.0       2019
85      Natal 2019-01-02   16.88  ...    50.64             3.0       2019
99   Salvador 2019-01-01   40.38  ...    40.38             1.0       2019
57     Recife 2019-01-01  201.41  ...   604.23             3.0       2019
100     Natal 2019-01-02  190.97  ...   381.94             2.0       2019

[5 rows x 8 columns]

In [ ]:
#Extraindo o mÃªs e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
69     Recife 2019-01-01   38.83  ...      2019          1          1
33      Natal 2018-01-11  759.00  ...      2018          1         11
30   Salvador 2019-01-01   47.96  ...      2019          1          1
190  Salvador 2019-01-02   78.78  ...      2019          1          2
10    Aracaju 2019-01-01   42.34  ...      2019          1          1

[5 rows x 10 columns]

In [ ]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
#Calculando a diferenÃ§a de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [ ]:
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
99       Natal 2019-01-02   40.38  ...         1          2        366 days
80   Fortaleza 2019-01-01   47.88  ...         1          1        365 days
5       Recife 2019-01-01   13.59  ...         1          1        365 days
125      Natal 2019-01-02   25.00  ...         1          2        366 days
132  Fortaleza 2019-03-02   17.49  ...         3          2        425 days

[5 rows x 11 columns]

In [ ]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
55     Recife 2019-01-01   20.03  ...         1        365 days                1
94    Aracaju 2018-01-01  198.24  ...         1          0 days                1
178     Natal 2019-01-02   39.28  ...         2        366 days                1
81   Salvador 2019-01-01   17.36  ...         1        365 days                1
54     Recife 2019-01-01   23.43  ...         1        365 days                1

[5 rows x 12 columns]

In [ ]:
#Filtrando as vendas de 2019 do mÃªs de marÃ§o
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [ ]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
131     Recife 2019-03-02  139.07  ...         2        425 days                1
130   Salvador 2019-03-02   59.78  ...         2        425 days                1
74       Natal 2019-03-10  303.00  ...        10        433 days                1
4        Natal 2019-03-09  699.00  ...         9        432 days                1
134     Recife 2019-03-02  195.18  ...         2        425 days                1
135     Recife 2019-03-02   10.79  ...         2        425 days                1
135   Salvador 2019-03-02    9.95  ...         2        425 days                1
141   Salvador 2019-03-02    9.08  ...         2        425 days                1
125  Fortaleza 2019-03-02   37.60  ...         2        425 days                1
141  Fortaleza 2019-03-02  182.75  ...         2        425 days                1
122   Salvador 2019-03-02   13.27  ...         2        425 days                1
32       Natal 2019-03-17  244.00  ...        17        440 days                1
127   Salvador 2019-03-02  240.61  ...         2        425 days                1
129   Salvador 2019-03-02  125.66  ...         2        425 days                1
140  Fortaleza 2019-03-02  166.89  ...         2        425 days                1
18       Natal 2019-03-14  581.00  ...        14        437 days                1
140   Salvador 2019-03-02   20.79  ...         2        425 days                1
121     Recife 2019-03-02   41.55  ...         2        425 days                1
109   Salvador 2019-03-02  124.37  ...         2        425 days                1
42       Natal 2019-03-02  775.00  ...         2        425 days                1

[20 rows x 12 columns]